In [0]:
import pandas as pd
import seaborn as sns
import numpy as np
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [0]:
titanic_data = sns.load_dataset('titanic')

In [6]:

titanic_data.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [7]:
titanic_data.shape

(891, 15)

In [8]:
titanic_data = titanic_data[['survived', 'pclass', 'sex', 'age', 'embarked']]
titanic_data.dropna(axis=0, inplace=True)
titanic_data['sex'].replace(['male', 'female'], [0, 1], inplace=True)
titanic_data.head()

   survived  pclass  sex   age embarked
0         0       3    0  22.0        S
1         1       1    1  38.0        C
2         1       3    1  26.0        S
3         1       1    1  35.0        S
4         0       3    0  35.0        S

In [9]:
titanic_data['embarked'].value_counts()

S    554
C    130
Q     28
Name: embarked, dtype: int64

In [0]:
d1 = {'S': 0, 'C':1, 'Q':2}
titanic_data['embarked'] = titanic['embarked'].map(d1)

In [11]:
titanic_data.head()

   survived  pclass  sex   age  embarked
0         0       3    0  22.0       0.0
1         1       1    1  38.0       1.0
2         1       3    1  26.0       0.0
3         1       1    1  35.0       0.0
4         0       3    0  35.0       0.0

In [12]:
titanic_data['embarked'].value_counts()

0.0    554
1.0    130
2.0     28
Name: embarked, dtype: int64

In [0]:
model = KNeighborsClassifier()

In [0]:
X = titanic_data.iloc[:, 1:]
y = titanic_data['survived']

In [21]:
X

     pclass  sex   age  embarked
0         3    0  22.0       0.0
1         1    1  38.0       1.0
2         3    1  26.0       0.0
3         1    1  35.0       0.0
4         3    0  35.0       0.0
..      ...  ...   ...       ...
885       3    1  39.0       2.0
886       2    0  27.0       0.0
887       1    1  19.0       0.0
889       1    0  26.0       1.0
890       3    0  32.0       2.0

[712 rows x 4 columns]

In [22]:
y

0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: survived, Length: 712, dtype: int64

In [53]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25)
model.fit(X, y)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                     weights='uniform')

In [54]:
model.predict(X_test)

array([0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1,
       0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0,
       0, 1])

In [0]:
y_pred = model.predict(X_test)

In [56]:
print("accuracy : ", accuracy_score(y_pred, y_test))

accuracy :  0.8426966292134831

In [0]:
def survival(model, pclass=1, sex=1, age=28, embarked=0):
  x = np.array([pclass, sex, age, embarked]).reshape(1, 4)
  a = model.predict(x)
  if a == [0]:
    print("Dead")
  else:
    print("alive")

In [42]:
survival(model)

alive